question = "Какую задачу Вам нужно решить?"
print(question)
F1 = "1)Задача на кодирование информаци"
F2 = "2)Задача на кодирование звука"
F3 = "3)Задача на кодирование изображения"
print(F1)
print(F2)
print(F3)
D = input("Введите номер вопроса:")
if (D=="1"):
    print(F1)
if  (D=="2"):
    print(F2)
if (D=="3"):
    print(F3);    
question2 = "Что Вам нужно найти?"
print(question2)
a1 = "1)общее колво инфы"
a2 = "2)мощность алфавита"
a3 = "3)информационный вес символа"
print(a1)
print(a2)
print(a3)
E = input("Введите номер вопроса:")
if (E=="1"):
    print(a1)
s = input("Введите инф вес символа")
if  (E=="2"):
    print(a2)
if (E=="3"):
      print(a3);

